{"<PAD>": 0, "<UNK>": 1, "in": 2, "entry": 3, "purchase": 4, "payment": 5, "sqft": 6, "condition": 7, "arv": 8, "0": 9, "bed": 10, "bath": 11, "occupancy": 12, "rehab": 13, "2": 14, "3": 15, "family": 16, "single": 17, "1": 18, "under": 19, "5": 20, "occupied": 21, "vacant": 22, "max": 23, "me": 24, "with": 25, "beds": 26, "at": 27, "least": 28, "deals": 29, "and": 30, "any": 31, "light": 32, "4": 33, "to": 34, "medium": 35, "tenant": 36, "cash": 37, "or": 38, "owner": 39, "seller": 40, "finance": 41, "subto": 42, "heavy": 43, "turnkey": 44, "land": 45, "looking": 46, "for": 47, "preferred": 48, "show": 49, "baths": 50, "find": 51, "opportunities": 52, "built": 53, "after": 54, "need": 55, "budget": 56, "up": 57, "fee": 58, "hybrid": 59, "lease": 60, "rent": 61, "own": 62, "wrap": 63, "deal": 64, "dscr": 65, "carryback": 66, "co": 67, "condo": 68, "townhouse": 69, "sc": 70, "tn": 71, "nc": 72, "tx": 73, "fl": 74, "manufactured": 75, "ca": 76, "greenville": 77, "ga": 78, "az": 79, "multi": 80, "riverton": 81, "la": 82, "oh": 83, "va": 84, "pa": 85, "nv": 86, "ms": 87, "franklin": 88, "fairview": 89, "ok": 90, "il": 91, "mi": 92, "ut": 93, "al": 94, "madison": 95, "mo": 96, "springfield": 97, "md": 98, "wa": 99, "ltr": 100, "mtr": 101, "6": 102, "str": 103, "fix": 104, "flip": 105, "n": 106, "a": 107, "strategy": 108, "wholesale": 109, "living": 110, "12": 111, "15": 112, "14": 113, "13": 114, "17": 115, "11": 116, "18": 117, "16": 118, "property": 119, "type": 120, "9": 121, "19": 122, "knoxville": 123, "22": 124, "memphis": 125, "san": 126, "mauldin": 127, "nashville": 128, "21": 129, "25": 130, "24": 131, "23": 132, "8": 133, "charleston": 134, "20": 135, "000": 136, "10": 137, "durham": 138, "charlotte": 139, "los": 140, "angeles": 141, "28": 142, "27": 143, "sacramento": 144, "7": 145, "raleigh": 146, "26": 147, "four": 148, "oaks": 149, "tampa": 150, "33": 151, "loganville": 152, "riverside": 153, "jonesboro": 154, "atlanta": 155, "diego": 156, "orlando": 157, "savannah": 158, "120": 159, "lakeland": 160, "31": 161, "35": 162, "38": 163, "07": 164, "peoria": 165, "miami": 166, "dallas": 167, "29": 168, "houston": 169, "jacksonville": 170, "92": 171, "06": 172, "augusta": 173, "86": 174, "34": 175, "49": 176, "41": 177, "austin": 178, "mesa": 179, "500": 180, "phoenix": 181, "76": 182, "antonio": 183, "tempe": 184, "90": 185, "04": 186, "chandler": 187, "54": 188, "58": 189, "el": 190, "paso": 191, "08": 192, "55": 193, "68": 194, "95": 195, "56": 196, "64": 197, "98": 198, "39": 199, "37": 200, "75": 201, "74": 202, "84": 203, "62": 204, "jarrell": 205, "52": 206, "32": 207, "175": 208, "97": 209, "73": 210, "tucson": 211, "57": 212, "88": 213, "69": 214, "44": 215, "94": 216, "89": 217, "71": 218, "148": 219, "09": 220, "51": 221, "61": 222, "177": 223, "42": 224, "77": 225, "36": 226, "78": 227, "82": 228, "59": 229, "47": 230, "67": 231, "149": 232, "173": 233, "99": 234, "45": 235, "03": 236, "fort": 237, "worth": 238, "83": 239, "01": 240, "46": 241, "91": 242, "63": 243, "72": 244, "02": 245, "05": 246, "169": 247, "206": 248, "93": 249, "96": 250, "85": 251, "65": 252, "220": 253, "232": 254, "207": 255, "179": 256, "196": 257, "202": 258, "184": 259, "43": 260, "81": 261, "79": 262, "201": 263, "151": 264, "139": 265, "215": 266, "209": 267, "48": 268, "199": 269, "222": 270, "200": 271, "247": 272, "155": 273, "250": 274, "249": 275, "181": 276, "178": 277, "152": 278, "210": 279, "87": 280, "189": 281, "163": 282, "223": 283, "230": 284, "190": 285, "154": 286, "183": 287, "188": 288, "211": 289, "146": 290, "191": 291, "66": 292, "142": 293, "182": 294, "168": 295, "161": 296, "170": 297, "158": 298, "156": 299, "192": 300, "172": 301, "159": 302, "292": 303, "205": 304, "212": 305, "195": 306, "193": 307, "218": 308, "150": 309, "147": 310, "171": 311, "225": 312, "1961": 313, "53": 314, "194": 315, "125": 316, "123": 317, "164": 318, "203": 319, "246": 320, "1962": 321, "237": 322, "214": 323, "255": 324, "208": 325, "277": 326, "176": 327, "260": 328, "180": 329, "157": 330, "217": 331, "186": 332, "228": 333, "216": 334, "1969": 335, "174": 336, "185": 337, "241": 338, "137": 339, "233": 340, "1966": 341, "1994": 342, "1963": 343, "258": 344, "272": 345, "259": 346, "1971": 347, "204": 348, "227": 349, "197": 350, "219": 351, "162": 352, "213": 353, "1958": 354, "257": 355, "127": 356, "140": 357, "285": 358, "141": 359, "136": 360, "1991": 361, "226": 362, "320": 363, "135": 364, "238": 365, "167": 366, "1949": 367, "1977": 368, "1965": 369, "275": 370, "1956": 371, "299": 372, "234": 373, "256": 374, "236": 375, "160": 376, "800": 377, "281": 378, "244": 379, "1957": 380, "240": 381, "198": 382, "144": 383, "1975": 384, "166": 385, "262": 386, "117": 387, "134": 388, "307": 389, "1981": 390, "861": 391, "1972": 392, "1979": 393, "274": 394, "266": 395, "153": 396, "254": 397, "251": 398, "286": 399, "30": 400, "327": 401, "165": 402, "1948": 403, "245": 404, "288": 405, "119": 406, "278": 407, "1968": 408, "145": 409, "128": 410, "1982": 411, "221": 412, "1953": 413, "1947": 414, "1984": 415, "243": 416, "231": 417, "132": 418, "1989": 419, "284": 420, "305": 421, "126": 422, "129": 423, "297": 424, "1940": 425, "282": 426, "1945": 427, "333": 428, "235": 429, "124": 430, "293": 431, "224": 432, "133": 433, "101": 434, "187": 435, "1946": 436, "1964": 437, "138": 438, "111": 439, "361": 440, "317": 441, "334": 442, "741": 443, "131": 444, "321": 445, "268": 446, "271": 447, "252": 448, "1980": 449, "264": 450, "322": 451, "130": 452, "229": 453, "1985": 454, "1937": 455, "427": 456, "1970": 457, "253": 458, "279": 459, "108": 460, "310": 461, "1999": 462, "1967": 463, "269": 464, "1941": 465, "1974": 466, "306": 467, "1960": 468, "267": 469, "276": 470, "385": 471, "122": 472, "471": 473, "1950": 474, "298": 475, "1997": 476, "336": 477, "311": 478, "100": 479, "2000": 480, "598": 481, "426": 482, "1990": 483, "1954": 484, "103": 485, "1951": 486, "356": 487, "1973": 488, "107": 489, "116": 490, "273": 491, "118": 492, "700": 493, "318": 494, "112": 495, "951": 496, "475": 497, "344": 498, "290": 499, "1988": 500, "1993": 501, "851": 502, "330": 503, "646": 504, "373": 505, "418": 506, "326": 507, "986": 508, "969": 509, "832": 510, "1986": 511, "341": 512, "265": 513, "880": 514, "059": 515, "109": 516, "242": 517, "362": 518, "345": 519, "372": 520, "121": 521, "114": 522, "1952": 523, "2025": 524, "743": 525, "989": 526, "446": 527, "363": 528, "291": 529, "017": 530, "687": 531, "1894": 532, "313": 533, "1942": 534, "303": 535, "239": 536, "349": 537, "319": 538, "625": 539, "513": 540, "348": 541, "900": 542, "631": 543, "950": 544, "903": 545, "740": 546, "821": 547, "379": 548, "822": 549, "339": 550, "397": 551, "270": 552, "022": 553, "032": 554, "540": 555, "527": 556, "1976": 557, "912": 558, "386": 559, "380": 560, "033": 561, "026": 562, "296": 563, "1938": 564, "316": 565, "1978": 566, "143": 567, "295": 568, "977": 569, "289": 570, "324": 571, "294": 572, "301": 573, "715": 574, "936": 575, "2315": 576, "352": 577, "412": 578, "724": 579, "578": 580, "248": 581, "382": 582, "323": 583, "886": 584, "371": 585, "666": 586, "422": 587, "824": 588, "922": 589, "978": 590, "874": 591, "335": 592, "924": 593, "401": 594, "359": 595, "450": 596, "261": 597, "029": 598, "994": 599, "920": 600, "360": 601, "577": 602, "2007": 603, "1935": 604, "641": 605, "998": 606, "1992": 607, "981": 608, "634": 609, "444": 610, "1987": 611, "1959": 612, "115": 613, "308": 614, "952": 615, "078": 616, "761": 617, "300": 618, "338": 619, "914": 620, "420": 621, "302": 622, "931": 623, "364": 624, "2009": 625, "2316": 626, "2521": 627, "2708": 628, "512": 629, "459": 630, "263": 631, "580": 632, "572": 633, "552": 634, "456": 635, "945": 636, "342": 637, "2003": 638, "736": 639, "938": 640, "315": 641, "406": 642, "729": 643, "877": 644, "411": 645, "831": 646, "328": 647, "389": 648, "366": 649, "304": 650, "113": 651, "419": 652, "529": 653, "656": 654, "283": 655, "099": 656, "782": 657, "445": 658, "947": 659, "314": 660, "392": 661, "595": 662, "350": 663, "074": 664, "919": 665, "551": 666, "104": 667, "453": 668, "733": 669, "718": 670, "458": 671, "095": 672, "1930": 673, "894": 674, "868": 675, "1943": 676, "834": 677, "996": 678, "377": 679, "370": 680, "081": 681, "856": 682, "340": 683, "780": 684, "037": 685, "477": 686, "534": 687, "052": 688, "393": 689, "1998": 690, "658": 691, "571": 692, "1939": 693, "692": 694, "704": 695, "2005": 696, "353": 697, "2014": 698, "2299": 699, "2087": 700, "2401": 701, "2110": 702, "2321": 703, "2252": 704, "375": 705, "524": 706, "606": 707, "627": 708, "556": 709, "405": 710, "907": 711, "964": 712, "891": 713, "946": 714, "085": 715, "564": 716, "287": 717, "523": 718, "482": 719, "673": 720, "1955": 721, "536": 722, "463": 723, "438": 724, "337": 725, "899": 726, "582": 727, "071": 728, "280": 729, "630": 730, "414": 731, "758": 732, "1934": 733, "096": 734, "399": 735, "1916": 736, "801": 737, "1944": 738, "928": 739, "689": 740, "368": 741, "2002": 742, "819": 743, "1995": 744, "547": 745, "408": 746, "701": 747, "965": 748, "490": 749, "604": 750, "763": 751, "537": 752, "850": 753, "576": 754, "535": 755, "1926": 756, "502": 757, "008": 758, "069": 759, "764": 760, "491": 761, "999": 762, "651": 763, "600": 764, "429": 765, "550": 766, "959": 767, "354": 768, "967": 769, "749": 770, "485": 771, "613": 772, "514": 773, "092": 774, "826": 775, "493": 776, "702": 777, "765": 778, "381": 779, "1983": 780, "616": 781, "1927": 782, "1925": 783, "2440": 784, "2241": 785, "2129": 786, "2531": 787, "2026": 788, "2054": 789, "2414": 790, "2311": 791, "2482": 792, "2263": 793, "2302": 794, "2286": 795, "887": 796, "329": 797, "358": 798, "416": 799, "528": 800, "990": 801, "987": 802, "863": 803, "655": 804, "932": 805, "842": 806, "827": 807, "423": 808, "378": 809, "587": 810, "467": 811, "012": 812, "731": 813, "023": 814, "807": 815, "897": 816, "480": 817, "346": 818, "569": 819, "048": 820, "430": 821, "503": 822, "661": 823, "750": 824, "777": 825, "614": 826, "497": 827, "652": 828, "791": 829, "593": 830, "053": 831, "841": 832, "525": 833, "771": 834, "809": 835, "410": 836, "309": 837, "615": 838, "727": 839, "828": 840, "976": 841, "387": 842, "852": 843, "779": 844, "548": 845, "2001": 846, "102": 847, "546": 848, "848": 849, "721": 850, "014": 851, "679": 852, "898": 853, "325": 854, "712": 855, "649": 856, "396": 857, "916": 858, "413": 859, "669": 860, "686": 861, "813": 862, "988": 863, "391": 864, "683": 865, "106": 866, "793": 867, "756": 868, "993": 869, "846": 870, "972": 871, "066": 872, "067": 873, "858": 874, "642": 875, "383": 876, "734": 877, "870": 878, "312": 879, "975": 880, "901": 881, "421": 882, "847": 883, "982": 884, "084": 885, "635": 886, "1933": 887, "781": 888, "708": 889, "739": 890, "864": 891, "788": 892, "343": 893, "594": 894, "507": 895, "562": 896, "607": 897, "1929": 898, "2308": 899, "2743": 900, "2395": 901, "2211": 902, "1829": 903, "2269": 904, "2328": 905, "2097": 906, "2092": 907, "1772": 908, "2617": 909, "2434": 910, "2493": 911, "2229": 912, "2556": 913, "2273": 914, "2524": 915, "2225": 916, "2100": 917, "2198": 918, "2890": 919, "2303": 920, "2332": 921, "2305": 922, "2667": 923, "2510": 924, "1791": 925, "2209": 926, "448": 927, "460": 928, "054": 929, "431": 930, "105": 931, "002": 932, "515": 933, "432": 934, "2011": 935, "417": 936, "769": 937, "970": 938, "825": 939, "437": 940, "711": 941, "542": 942, "601": 943, "973": 944, "351": 945, "050": 946, "671": 947, "804": 948, "694": 949, "076": 950, "917": 951, "872": 952, "778": 953, "1921": 954, "610": 955, "742": 956, "559": 957, "347": 958, "520": 959, "013": 960, "481": 961, "2010": 962, "083": 963, "659": 964, "010": 965, "939": 966, "984": 967, "678": 968, "388": 969, "798": 970, "434": 971, "918": 972, "539": 973, "911": 974, "1454": 975, "436": 976, "713": 977, "065": 978, "816": 979, "717": 980, "589": 981, "623": 982, "648": 983, "637": 984, "443": 985, "498": 986, "560": 987, "055": 988, "019": 989, "573": 990, "532": 991, "760": 992, "632": 993, "501": 994, "451": 995, "879": 996, "787": 997, "585": 998, "806": 999, "545": 1000, "785": 1001, "476": 1002, "881": 1003, "505": 1004, "579": 1005, "449": 1006, "567": 1007, "839": 1008, "1936": 1009, "025": 1010, "533": 1011, "794": 1012, "461": 1013, "797": 1014, "409": 1015, "1912": 1016, "404": 1017, "866": 1018, "871": 1019, "395": 1020, "355": 1021, "935": 1022, "944": 1023, "888": 1024, "893": 1025, "543": 1026, "415": 1027, "1597": 1028, "110": 1029, "618": 1030, "591": 1031, "484": 1032, "722": 1033, "814": 1034, "691": 1035, "483": 1036, "479": 1037, "027": 1038, "424": 1039, "086": 1040, "929": 1041, "357": 1042, "2006": 1043, "2004": 1044, "647": 1045, "941": 1046, "1277": 1047, "403": 1048, "1624": 1049, "1319": 1050, "1812": 1051, "2021": 1052, "2160": 1053, "2888": 1054, "2053": 1055, "1878": 1056, "1545": 1057, "2062": 1058, "2642": 1059, "2140": 1060, "2463": 1061, "2151": 1062, "2381": 1063, "2800": 1064, "2047": 1065, "2490": 1066, "2285": 1067, "2082": 1068, "2529": 1069, "2331": 1070, "2192": 1071, "2608": 1072, "2638": 1073, "2972": 1074, "2640": 1075, "2390": 1076, "2573": 1077, "2329": 1078, "2468": 1079, "2298": 1080, "2378": 1081, "2126": 1082, "2744": 1083, "2385": 1084, "2266": 1085, "2429": 1086, "2240": 1087, "2618": 1088, "2352": 1089, "2256": 1090, "2195": 1091, "2424": 1092, "2261": 1093, "063": 1094, "629": 1095, "992": 1096, "786": 1097, "602": 1098, "840": 1099, "884": 1100, "690": 1101, "603": 1102, "675": 1103, "668": 1104, "744": 1105, "031": 1106, "730": 1107, "046": 1108, "638": 1109, "927": 1110, "930": 1111, "590": 1112, "773": 1113, "957": 1114, "676": 1115, "783": 1116, "365": 1117, "696": 1118, "440": 1119, "435": 1120, "974": 1121, "983": 1122, "767": 1123, "784": 1124, "1387": 1125, "755": 1126, "433": 1127, "374": 1128, "643": 1129, "703": 1130, "688": 1131, "829": 1132, "910": 1133, "519": 1134, "748": 1135, "041": 1136, "043": 1137, "725": 1138, "331": 1139, "1923": 1140, "082": 1141, "581": 1142, "883": 1143, "486": 1144, "1055": 1145, "799": 1146, "697": 1147, "684": 1148, "592": 1149, "759": 1150, "876": 1151, "766": 1152, "862": 1153, "940": 1154, "677": 1155, "921": 1156, "531": 1157, "596": 1158, "1115": 1159, "474": 1160, "682": 1161, "890": 1162, "949": 1163, "835": 1164, "751": 1165, "857": 1166, "470": 1167, "985": 1168, "068": 1169, "838": 1170, "823": 1171, "611": 1172, "1908": 1173, "332": 1174, "428": 1175, "770": 1176, "407": 1177, "752": 1178, "622": 1179, "2017": 1180, "768": 1181, "757": 1182, "612": 1183, "042": 1184, "737": 1185, "1924": 1186, "792": 1187, "609": 1188, "077": 1189, "1919": 1190, "494": 1191, "904": 1192, "859": 1193, "058": 1194, "1438": 1195, "2020": 1196, "1660": 1197, "626": 1198, "1673": 1199, "1996": 1200, "2032": 1201, "1914": 1202, "1906": 1203, "1860": 1204, "2376": 1205, "2199": 1206, "2677": 1207, "1505": 1208, "3043": 1209, "2280": 1210, "2646": 1211, "2509": 1212, "2734": 1213, "2085": 1214, "2064": 1215, "2758": 1216, "2422": 1217, "2034": 1218, "3106": 1219, "2040": 1220, "2455": 1221, "2731": 1222, "2272": 1223, "1864": 1224, "2191": 1225, "2116": 1226, "2688": 1227, "2544": 1228, "2681": 1229, "2693": 1230, "2445": 1231, "2365": 1232, "2680": 1233, "1702": 1234, "2143": 1235, "2253": 1236, "2111": 1237, "1713": 1238, "2119": 1239, "2194": 1240, "2657": 1241, "2467": 1242, "2788": 1243, "2077": 1244, "2027": 1245, "2373": 1246, "2283": 1247, "2081": 1248, "1811": 1249, "2459": 1250, "2279": 1251, "2281": 1252, "2359": 1253, "1644": 1254, "2869": 1255, "2207": 1256, "2480": 1257, "2589": 1258, "2135": 1259, "2676": 1260, "1793": 1261, "2136": 1262, "2837": 1263, "2714": 1264, "2419": 1265, "2096": 1266, "2797": 1267, "2787": 1268, "2410": 1269, "2752": 1270, "2154": 1271, "2438": 1272, "2476": 1273, "2765": 1274, "2678": 1275, "2426": 1276, "2112": 1277, "2575": 1278, "2070": 1279, "2183": 1280, "2660": 1281, "2907": 1282, "1813": 1283, "2103": 1284, "2181": 1285, "2319": 1286, "2342": 1287, "2093": 1288, "1818": 1289, "035": 1290, "667": 1291, "073": 1292, "908": 1293, "597": 1294, "624": 1295, "563": 1296, "833": 1297, "522": 1298, "2175": 1299, "462": 1300, "720": 1301, "549": 1302, "956": 1303, "728": 1304, "789": 1305, "016": 1306, "049": 1307, "803": 1308, "541": 1309, "909": 1310, "056": 1311, "464": 1312, "979": 1313, "663": 1314, "367": 1315, "698": 1316, "472": 1317, "747": 1318, "447": 1319, "1918": 1320, "953": 1321, "398": 1322, "775": 1323, "753": 1324, "818": 1325, "1410": 1326, "905": 1327, "517": 1328, "061": 1329, "487": 1330, "568": 1331, "575": 1332, "617": 1333, "441": 1334, "1792": 1335, "554": 1336, "796": 1337, "089": 1338, "810": 1339, "390": 1340, "790": 1341, "452": 1342, "093": 1343, "509": 1344, "045": 1345, "776": 1346, "018": 1347, "902": 1348, "538": 1349, "865": 1350, "605": 1351, "889": 1352, "836": 1353, "869": 1354, "680": 1355, "962": 1356, "873": 1357, "937": 1358, "047": 1359, "738": 1360, "762": 1361, "843": 1362, "034": 1363, "774": 1364, "855": 1365, "510": 1366, "454": 1367, "772": 1368, "644": 1369, "376": 1370, "1931": 1371, "495": 1372, "845": 1373, "009": 1374, "934": 1375, "469": 1376, "1920": 1377, "654": 1378, "030": 1379, "892": 1380, "660": 1381, "489": 1382, "1796": 1383, "558": 1384, "1204": 1385, "933": 1386, "1554": 1387, "926": 1388, "963": 1389, "802": 1390, "961": 1391, "640": 1392, "439": 1393, "057": 1394, "968": 1395, "896": 1396, "021": 1397, "636": 1398, "895": 1399, "1676": 1400, "1932": 1401, "1511": 1402, "1473": 1403, "942": 1404, "511": 1405, "923": 1406, "1413": 1407, "1672": 1408, "1870": 1409, "060": 1410, "2018": 1411, "954": 1412, "997": 1413, "1903": 1414, "1632": 1415, "1765": 1416, "1694": 1417, "1750": 1418, "2697": 1419, "2535": 1420, "2630": 1421, "2174": 1422, "2570": 1423, "2553": 1424, "2555": 1425, "2740": 1426, "1839": 1427, "2577": 1428, "2341": 1429, "2686": 1430, "2583": 1431, "2590": 1432, "2443": 1433, "2139": 1434, "2446": 1435, "2483": 1436, "2447": 1437, "2747": 1438, "2177": 1439, "3078": 1440, "2644": 1441, "1730": 1442, "2858": 1443, "2560": 1444, "2327": 1445, "2997": 1446, "2314": 1447, "2539": 1448, "2648": 1449, "2108": 1450, "2288": 1451, "2793": 1452, "2071": 1453, "2855": 1454, "2334": 1455, "1825": 1456, "2427": 1457, "2091": 1458, "2159": 1459, "2582": 1460, "2357": 1461, "2701": 1462, "2074": 1463, "2503": 1464, "2282": 1465, "2789": 1466, "2511": 1467, "2185": 1468, "2200": 1469, "2383": 1470, "2557": 1471, "2695": 1472, "1770": 1473, "2347": 1474, "2899": 1475, "2295": 1476, "2417": 1477, "2218": 1478, "2117": 1479, "2187": 1480, "1882": 1481, "2346": 1482, "2485": 1483, "2364": 1484, "2287": 1485, "2219": 1486, "2317": 1487, "2533": 1488, "2948": 1489, "2491": 1490, "2051": 1491, "2015": 1492, "2908": 1493, "2144": 1494, "2146": 1495, "1862": 1496, "1869": 1497, "1904": 1498, "1491": 1499, "2532": 1500, "1474": 1501, "2044": 1502, "2605": 1503, "2335": 1504, "2946": 1505, "2519": 1506, "2738": 1507, "2451": 1508, "2992": 1509, "2171": 1510, "2149": 1511, "2042": 1512, "2770": 1513, "1803": 1514, "3077": 1515, "2454": 1516, "2236": 1517, "2076": 1518, "2416": 1519, "1859": 1520, "2811": 1521, "2168": 1522, "2360": 1523, "1630": 1524, "2826": 1525, "2147": 1526, "2462": 1527, "2131": 1528, "2517": 1529, "1797": 1530, "2231": 1531, "2902": 1532, "2293": 1533, "3009": 1534, "2088": 1535, "2215": 1536, "2079": 1537, "2204": 1538, "2206": 1539, "1620": 1540, "2078": 1541, "2613": 1542, "3471": 1543, "2060": 1544, "2275": 1545, "2265": 1546, "2478": 1547, "2247": 1548, "2411": 1549, "2917": 1550, "2396": 1551, "2839": 1552, "2944": 1553, "1649": 1554, "2201": 1555, "1843": 1556, "1651": 1557, "915": 1558, "1163": 1559, "586": 1560, "506": 1561, "735": 1562, "003": 1563, "754": 1564, "732": 1565, "400": 1566, "521": 1567, "553": 1568, "1296": 1569, "565": 1570, "664": 1571, "849": 1572, "795": 1573, "925": 1574, "943": 1575, "036": 1576, "1900": 1577, "2170": 1578, "885": 1579, "574": 1580, "044": 1581, "674": 1582, "530": 1583, "1704": 1584, "948": 1585, "1565": 1586, "628": 1587, "966": 1588, "544": 1589, "40": 1590, "566": 1591, "619": 1592, "1727": 1593, "633": 1594, "1531": 1595, "621": 1596, "1442": 1597, "384": 1598, "913": 1599, "098": 1600, "685": 1601, "465": 1602, "091": 1603, "1587": 1604, "024": 1605, "820": 1606, "1362": 1607, "499": 1608, "710": 1609, "038": 1610, "488": 1611, "039": 1612, "496": 1613, "2016": 1614, "1493": 1615, "706": 1616, "854": 1617, "040": 1618, "090": 1619, "457": 1620, "561": 1621, "442": 1622, "991": 1623, "1192": 1624, "2059": 1625, "557": 1626, "001": 1627, "693": 1628, "369": 1629, "1758": 1630, "716": 1631, "723": 1632, "2008": 1633, "837": 1634, "955": 1635, "971": 1636, "1658": 1637, "508": 1638, "504": 1639, "719": 1640, "1615": 1641, "028": 1642, "817": 1643, "478": 1644, "1681": 1645, "995": 1646, "1260": 1647, "468": 1648, "1826": 1649, "1337": 1650, "1582": 1651, "2013": 1652, "1003": 1653, "1809": 1654, "1524": 1655, "1311": 1656, "662": 1657, "1804": 1658, "1830": 1659, "1389": 1660, "1527": 1661, "1411": 1662, "1304": 1663, "1441": 1664, "1806": 1665, "1435": 1666, "1768": 1667, "1488": 1668, "1377": 1669, "1271": 1670, "2173": 1671, "2105": 1672, "2597": 1673, "2035": 1674, "1891": 1675, "1863": 1676, "3017": 1677, "3025": 1678, "1858": 1679, "1677": 1680, "2543": 1681, "1852": 1682, "2368": 1683, "2420": 1684, "2107": 1685, "2717": 1686, "2213": 1687, "2647": 1688, "1890": 1689, "2961": 1690, "1578": 1691, "2109": 1692, "2884": 1693, "2402": 1694, "3037": 1695, "2756": 1696, "2804": 1697, "2965": 1698, "2571": 1699, "1888": 1700, "2423": 1701, "2762": 1702, "2729": 1703, "2222": 1704, "1479": 1705, "2061": 1706, "1853": 1707, "2202": 1708, "2470": 1709, "1876": 1710, "3326": 1711, "2551": 1712, "2270": 1713, "2065": 1714, "2052": 1715, "2591": 1716, "2566": 1717, "2343": 1718, "2928": 1719, "1610": 1720, "2456": 1721, "2409": 1722, "2098": 1723, "2242": 1724, "2723": 1725, "1883": 1726, "2854": 1727, "2927": 1728, "2767": 1729, "2041": 1730, "2379": 1731, "1726": 1732, "1841": 1733, "2337": 1734, "2594": 1735, "1773": 1736, "2404": 1737, "2115": 1738, "2637": 1739, "2943": 1740, "2138": 1741, "2083": 1742, "2542": 1743, "2472": 1744, "2959": 1745, "2224": 1746, "2290": 1747, "3323": 1748, "2152": 1749, "1755": 1750, "2655": 1751, "1872": 1752, "3068": 1753, "2528": 1754, "2223": 1755, "2645": 1756, "2971": 1757, "10313": 1758, "2821": 1759, "2903": 1760, "2663": 1761, "2846": 1762, "2776": 1763, "3008": 1764, "2278": 1765, "1751": 1766, "2773": 1767, "1744": 1768, "2413": 1769, "2851": 1770, "2724": 1771, "3166": 1772, "2203": 1773, "2689": 1774, "2587": 1775, "1669": 1776, "2220": 1777, "2380": 1778, "1875": 1779, "1873": 1780, "2606": 1781, "1790": 1782, "1665": 1783, "2580": 1784, "2600": 1785, "1911": 1786, "2641": 1787, "2186": 1788, "2672": 1789, "2441": 1790, "1886": 1791, "1849": 1792, "2056": 1793, "2142": 1794, "1625": 1795, "2669": 1796, "2296": 1797, "2121": 1798, "2046": 1799, "1867": 1800, "2634": 1801, "1133": 1802, "2067": 1803, "2624": 1804, "2030": 1805, "2515": 1806, "2506": 1807, "2255": 1808, "2031": 1809, "3668": 1810, "2477": 1811, "2418": 1812, "2437": 1813, "2210": 1814, "1799": 1815, "2377": 1816, "1855": 1817, "2799": 1818, "2602": 1819, "1847": 1820, "2712": 1821, "2400": 1822, "2845": 1823, "2704": 1824, "2431": 1825, "2382": 1826, "2297": 1827, "3103": 1828, "2134": 1829, "2371": 1830, "1782": 1831, "2284": 1832, "1815": 1833, "2827": 1834, "2444": 1835, "2696": 1836, "2757": 1837, "2233": 1838, "2386": 1839, "1913": 1840, "1498": 1841, "1708": 1842, "2405": 1843, "2545": 1844, "2063": 1845, "2084": 1846, "2822": 1847, "1655": 1848, "2728": 1849, "2350": 1850, "2212": 1851, "2167": 1852, "2398": 1853, "2615": 1854, "2161": 1855, "2388": 1856, "2184": 1857, "2565": 1858, "2363": 1859, "2653": 1860, "2258": 1861, "1899": 1862, "2612": 1863, "2326": 1864, "1802": 1865, "2075": 1866, "2250": 1867, "3946": 1868, "2101": 1869, "1734": 1870, "2338": 1871, "2563": 1872, "2479": 1873, "2268": 1874, "1850": 1875, "1833": 1876, "1161": 1877, "653": 1878, "1712": 1879, "087": 1880, "570": 1881, "080": 1882, "2028": 1883, "064": 1884, "020": 1885, "526": 1886, "812": 1887, "518": 1888, "1217": 1889, "1619": 1890, "867": 1891, "608": 1892, "645": 1893, "1109": 1894, "1608": 1895, "492": 1896, "072": 1897, "815": 1898, "1042": 1899, "1396": 1900, "1268": 1901, "1415": 1902, "455": 1903, "1177": 1904, "1353": 1905, "555": 1906, "1482": 1907, "1575": 1908, "1321": 1909, "714": 1910, "402": 1911, "1310": 1912, "1213": 1913, "620": 1914, "1317": 1915, "1282": 1916, "2127": 1917, "1265": 1918, "1121": 1919, "1603": 1920, "695": 1921, "707": 1922, "639": 1923, "588": 1924, "1256": 1925, "1585": 1926, "1080": 1927, "1299": 1928, "1333": 1929, "1553": 1930, "070": 1931, "657": 1932, "960": 1933, "882": 1934, "1037": 1935, "1602": 1936, "1170": 1937, "425": 1938, "1331": 1939, "1430": 1940, "473": 1941, "1917": 1942, "1297": 1943, "1424": 1944, "1345": 1945, "1164": 1946, "805": 1947, "705": 1948, "1183": 1949, "1207": 1950, "1201": 1951, "004": 1952, "1130": 1953, "1521": 1954, "1520": 1955, "1030": 1956, "1356": 1957, "466": 1958, "584": 1959, "1214": 1960, "1118": 1961, "1636": 1962, "1191": 1963, "878": 1964, "1122": 1965, "1327": 1966, "1390": 1967, "1287": 1968, "1781": 1969, "1551": 1970, "394": 1971, "1245": 1972, "1309": 1973, "1291": 1974, "094": 1975, "1365": 1976, "1269": 1977, "1004": 1978, "1135": 1979, "1613": 1980, "1237": 1981, "1465": 1982, "709": 1983, "1667": 1984, "1063": 1985, "1426": 1986, "1349": 1987, "1562": 1988, "1350": 1989, "1222": 1990, "1423": 1991, "1526": 1992, "1367": 1993, "1288": 1994, "1496": 1995, "1286": 1996, "1639": 1997, "1306": 1998, "3794": 1999, "3972": 2000, "3324": 2001, "2537": 2002, "2069": 2003, "3610": 2004, "1698": 2005, "1453": 2006, "3122": 2007, "2153": 2008, "1517": 2009, "1425": 2010, "2244": 2011, "2267": 2012, "2179": 2013, "2628": 2014, "396722": 2015, "2473": 2016, "1884": 2017, "2148": 2018, "2802": 2019, "3128": 2020, "1794": 2021, "1654": 2022, "1571": 2023, "1489": 2024, "2662": 2025, "2072": 2026, "3084": 2027, "3531": 2028, "3100": 2029, "1824": 2030, "2164": 2031, "2817": 2032, "2664": 2033, "2481": 2034, "3298": 2035, "2805": 2036, "2248": 2037, "2534": 2038, "1760": 2039, "2751": 2040, "1640": 2041, "2487": 2042, "2099": 2043, "2595": 2044, "2094": 2045, "3085": 2046, "1769": 2047, "2325": 2048, "2291": 2049, "3062": 2050, "1868": 2051, "2158": 2052, "2415": 2053, "2114": 2054, "2930": 2055, "1664": 2056, "3023": 2057, "2687": 2058, "1719": 2059, "3112": 2060, "5000": 2061, "2507": 2062, "2895": 2063, "2649": 2064, "3034": 2065, "2581": 2066, "2754": 2067, "2038": 2068, "1743": 2069, "1898": 2070, "2750": 2071, "3006": 2072, "2254": 2073, "2803": 2074, "2306": 2075, "1865": 2076, "3126": 2077, "1922": 2078, "2782": 2079, "544629": 2080, "2554": 2081, "2650": 2082, "2498": 2083, "2820": 2084, "2622": 2085, "2710": 2086, "2318": 2087, "3094": 2088, "3178": 2089, "2824": 2090, "3119": 2091, "2970": 2092, "2068": 2093, "2522": 2094, "1817": 2095, "2259": 2096, "1874": 2097, "2766": 2098, "2180": 2099, "3318": 2100, "2464": 2101, "1637": 2102, "1889": 2103, "2601": 2104, "3042": 2105, "1774": 2106, "1848": 2107, "2497": 2108, "2294": 2109, "2045": 2110, "2707": 2111, "2568": 2112, "2828": 2113, "1670": 2114, "2433": 2115, "2942": 2116, "2387": 2117, "2572": 2118, "2810": 2119, "2567": 2120, "2675": 2121, "2585": 2122, "2900": 2123, "2561": 2124, "3245": 2125, "2502": 2126, "2442": 2127, "2847": 2128, "2412": 2129, "3036": 2130, "2957": 2131, "2636": 2132, "2271": 2133, "2878": 2134, "3163": 2135, "2737": 2136, "2439": 2137, "1754": 2138, "1783": 2139, "2189": 2140, "2036": 2141, "3093": 2142, "2842": 2143, "2452": 2144, "3044": 2145, "2833": 2146, "1706": 2147, "3014": 2148, "1568": 2149, "3698": 2150, "1887": 2151, "1687": 2152, "2658": 2153, "2791": 2154, "1746": 2155, "3089": 2156, "2574": 2157, "3117": 2158, "2137": 2159, "3026": 2160, "3299": 2161, "2759": 2162, "2130": 2163, "2983": 2164, "3388": 2165, "1693": 2166, "2243": 2167, "3092": 2168, "2880": 2169, "2967": 2170, "3329": 2171, "2397": 2172, "2450": 2173, "2914": 2174, "2547": 2175, "2355": 2176, "2489": 2177, "2461": 2178, "2362": 2179, "1590": 2180, "1688": 2181, "2324": 2182, "2784": 2183, "19312": 2184, "3328": 2185, "2887": 2186, "2879": 2187, "2849": 2188, "2520": 2189, "2276": 2190, "1696": 2191, "2251": 2192, "2156": 2193, "3579": 2194, "3167": 2195, "2760": 2196, "2732": 2197, "1699": 2198, "2050": 2199, "3019": 2200, "1840": 2201, "1879": 2202, "2838": 2203, "2958": 2204, "2901": 2205, "2894": 2206, "2966": 2207, "2106": 2208, "2237": 2209, "2906": 2210, "2221": 2211, "2683": 2212, "2090": 2213, "3198": 2214, "1901": 2215, "2474": 2216, "2786": 2217, "2033": 2218, "245662": 2219, "2292": 2220, "3228": 2221, "2616": 2222, "2659": 2223, "2307": 2224, "3989": 2225, "2609": 2226, "2896": 2227, "1763": 2228, "1633": 2229, "2823": 2230, "1832": 2231, "2488": 2232, "2623": 2233, "2407": 2234, "1785": 2235, "3047": 2236, "1542": 2237, "3058": 2238, "2150": 2239, "1690": 2240, "2620": 2241, "2313": 2242, "2113": 2243, "1742": 2244, "2832": 2245, "3028": 2246, "1376": 2247, "1675": 2248, "1896": 2249, "2384": 2250, "2354": 2251, "2897": 2252, "2735": 2253, "3678": 2254, "1663": 2255, "2163": 2256, "1186": 2257, "1189": 2258, "1083": 2259, "2012": 2260, "1167": 2261, "088": 2262, "1252": 2263, "2022": 2264, "007": 2265, "1292": 2266, "1504": 2267, "1108": 2268, "1062": 2269, "1039": 2270, "1187": 2271, "1012": 2272, "1147": 2273, "1078": 2274, "051": 2275, "1395": 2276, "1276": 2277, "1104": 2278, "1459": 2279, "1179": 2280, "1354": 2281, "097": 2282, "1250": 2283, "1629": 2284, "1219": 2285, "1360": 2286, "1472": 2287, "670": 2288, "1581": 2289, "980": 2290, "006": 2291, "1028": 2292, "011": 2293, "1539": 2294, "853": 2295, "1027": 2296, "1434": 2297, "1238": 2298, "1228": 2299, "1370": 2300, "746": 2301, "860": 2302, "808": 2303, "1481": 2304, "1440": 2305, "811": 2306, "1477": 2307, "1155": 2308, "1205": 2309, "1162": 2310, "1169": 2311, "1842": 2312, "1211": 2313, "1240": 2314, "015": 2315, "1359": 2316, "1120": 2317, "1257": 2318, "1049": 2319, "1196": 2320, "1145": 2321, "1261": 2322, "1079": 2323, "1232": 2324, "1225": 2325, "1433": 2326, "1697": 2327, "1569": 2328, "1302": 2329, "906": 2330, "1357": 2331, "745": 2332, "1112": 2333, "1500": 2334, "1549": 2335, "1402": 2336, "1343": 2337, "1253": 2338, "1158": 2339, "1105": 2340, "1174": 2341, "1371": 2342, "844": 2343, "1641": 2344, "650": 2345, "1334": 2346, "1340": 2347, "1678": 2348, "1490": 2349, "1101": 2350, "1467": 2351, "1346": 2352, "1016": 2353, "1503": 2354, "830": 2355, "1685": 2356, "1054": 2357, "1798": 2358, "1461": 2359, "699": 2360, "062": 2361, "2019": 2362, "1928": 2363, "1127": 2364, "1313": 2365, "1375": 2366, "1557": 2367, "1223": 2368, "1279": 2369, "1374": 2370, "1446": 2371, "1470": 2372, "1643": 2373, "1573": 2374, "1666": 2375, "1522": 2376, "1040": 2377, "1264": 2378, "1775": 2379, "1180": 2380, "1184": 2381, "1149": 2382, "1910": 2383, "1267": 2384, "1341": 2385, "1502": 2386, "4315": 2387, "1468": 2388, "1100": 2389, "3398": 2390, "3146": 2391, "2351": 2392, "3252": 2393, "2668": 2394, "2133": 2395, "1561": 2396, "1525": 2397, "2366": 2398, "2841": 2399, "3063": 2400, "3673": 2401, "2348": 2402, "2739": 2403, "3415": 2404, "2746": 2405, "1588": 2406, "3098": 2407, "3061": 2408, "1778": 2409, "2500": 2410, "2372": 2411, "2141": 2412, "2465": 2413, "204604": 2414, "3286": 2415, "2457": 2416, "1599": 2417, "2872": 2418, "1756": 2419, "2162": 2420, "3546": 2421, "2857": 2422, "2257": 2423, "2513": 2424, "3498": 2425, "2929": 2426, "1805": 2427, "1369": 2428, "2905": 2429, "2945": 2430, "2558": 2431, "3314": 2432, "2128": 2433, "2588": 2434, "1160": 2435, "2619": 2436, "1560": 2437, "3731": 2438, "1567": 2439, "3184": 2440, "2679": 2441, "414268": 2442, "10325": 2443, "3108": 2444, "1753": 2445, "2304": 2446, "3500": 2447, "2309": 2448, "489832": 2449, "1338": 2450, "2718": 2451, "2995": 2452, "2501": 2453, "2188": 2454, "2375": 2455, "1731": 2456, "2344": 2457, "2910": 2458, "3157": 2459, "3107": 2460, "2238": 2461, "3782": 2462, "2719": 2463, "2654": 2464, "1819": 2465, "1428": 2466, "2330": 2467, "1752": 2468, "2166": 2469, "2576": 2470, "1776": 2471, "3127": 2472, "2399": 2473, "2353": 2474, "1893": 2475, "1462": 2476, "3674": 2477, "2540": 2478, "2783": 2479, "3645": 2480, "3194": 2481, "2621": 2482, "2037": 2483, "2277": 2484, "203330": 2485, "18450": 2486, "2794": 2487, "3256": 2488, "246030": 2489, "1648": 2490, "2239": 2491, "3067": 2492, "1801": 2493, "3116": 2494, "2394": 2495, "1627": 2496, "1518": 2497, "2881": 2498, "2771": 2499, "2536": 2500, "2408": 2501, "1451": 2502, "2991": 2503, "1607": 2504, "3082": 2505, "2235": 2506, "1828": 2507, "2807": 2508, "2264": 2509, "2569": 2510, "1909": 2511, "2825": 2512, "2690": 2513, "2289": 2514, "2058": 2515, "3849": 2516, "1307": 2517, "3189": 2518, "3071": 2519, "3135": 2520, "1787": 2521, "1400": 2522, "1820": 2523, "2430": 2524, "4179": 2525, "2774": 2526, "14576": 2527, "2403": 2528, "3269": 2529, "1659": 2530, "2393": 2531, "1173": 2532, "2720": 2533, "3277": 2534, "1897": 2535, "2232": 2536, "1789": 2537, "1657": 2538, "2670": 2539, "2626": 2540, "3132": 2541, "2260": 2542, "2994": 2543, "3165": 2544, "1837": 2545, "1336": 2546, "10777": 2547, "2214": 2548, "15386": 2549, "3097": 2550, "3606": 2551, "13341": 2552, "11329": 2553, "4313": 2554, "3321": 2555, "2604": 2556, "3680": 2557, "2546": 2558, "12376": 2559, "2939": 2560, "2703": 2561, "2918": 2562, "2391": 2563, "3716": 2564, "5056": 2565, "2998": 2566, "2216": 2567, "2798": 2568, "2949": 2569, "3798": 2570, "2593": 2571, "1877": 2572, "1661": 2573, "1700": 2574, "2157": 2575, "3186": 2576, "5880": 2577, "2320": 2578, "3111": 2579, "2656": 2580, "3254": 2581, "2611": 2582, "3177": 2583, "3059": 2584, "3288": 2585, "1598": 2586, "1733": 2587, "2484": 2588, "1450": 2589, "3000": 2590, "3065": 2591, "387997": 2592, "2778": 2593, "2549": 2594, "3075": 2595, "5468": 2596, "1653": 2597, "1786": 2598, "3719": 2599, "2453": 2600, "2661": 2601, "2745": 2602, "3607": 2603, "1616": 2604, "1725": 2605, "3011": 2606, "1626": 2607, "1497": 2608, "2830": 2609, "2249": 2610, "3244": 2611, "1851": 2612, "3101": 2613, "1220": 2614, "2692": 2615, "1611": 2616, "1484": 2617, "2048": 2618, "14440": 2619, "1168": 2620, "3212": 2621, "2893": 2622, "2986": 2623, "4369": 2624, "2361": 2625, "3408": 2626, "2428": 2627, "18983": 2628, "2806": 2629, "1885": 2630, "2471": 2631, "3001": 2632, "3308": 2633, "2709": 2634, "2989": 2635, "1779": 2636, "2607": 2637, "2698": 2638, "3488": 2639, "2716": 2640, "3364": 2641, "1834": 2642, "200464": 2643, "211206": 2644, "3911": 2645, "3152": 2646, "3039": 2647, "5404": 2648, "4033": 2649, "3762": 2650, "2460": 2651, "2875": 2652, "2538": 2653, "2530": 2654, "1807": 2655, "2122": 2656, "22214": 2657, "1323": 2658, "2073": 2659, "2625": 2660, "2125": 2661, "1857": 2662, "2715": 2663, "2969": 2664, "2990": 2665, "1729": 2666, "2496": 2667, "4324": 2668, "2856": 2669, "1716": 2670, "2790": 2671, "3073": 2672, "2892": 2673, "1866": 2674, "680325": 2675, "1795": 2676, "2169": 2677, "2262": 2678, "2921": 2679, "3250": 2680, "4480": 2681, "3292": 2682, "3242": 2683, "2486": 2684, "3095": 2685, "4309": 2686, "3641": 2687, "1646": 2688, "3280": 2689, "1880": 2690, "3125": 2691, "2889": 2692, "1606": 2693, "2753": 2694, "1577": 2695, "1821": 2696, "2934": 2697, "3032": 2698, "2954": 2699, "2815": 2700, "2436": 2701, "1284": 2702, "2598": 2703, "1159": 2704, "2931": 2705, "3012": 2706, "3020": 2707, "5280": 2708, "2768": 2709, "2469": 2710, "3291": 2711, "2182": 2712, "280976": 2713, "1777": 2714, "1471": 2715, "3387": 2716, "1710": 2717, "12579": 2718, "2421": 2719, "3639": 2720, "1838": 2721, "3243": 2722, "2924": 2723, "2312": 2724, "1871": 2725, "16809": 2726, "3144": 2727, "3867": 2728, "3696": 2729, "13833": 2730, "2674": 2731, "3566": 2732, "2632": 2733, "3333": 2734, "2514": 2735, "2208": 2736, "2977": 2737, "4476": 2738, "2873": 2739, "254199": 2740, "2512": 2741, "2955": 2742, "2504": 2743, "2527": 2744, "1703": 2745, "1509": 2746, "2736": 2747, "1715": 2748, "306783": 2749, "2741": 2750, "1724": 2751, "4041": 2752, "3149": 2753, "1478": 2754, "5499": 2755, "2190": 2756, "2339": 2757, "362936": 2758, "2973": 2759, "3339": 2760, "3174": 2761, "1759": 2762, "13374": 2763, "3475": 2764, "257718": 2765, "2370": 2766, "3049": 2767, "2960": 2768, "2596": 2769, "3441": 2770, "2882": 2771, "523834": 2772, "2755": 2773, "341686": 2774, "1364": 2775, "726": 2776, "1021": 2777, "1208": 2778, "1124": 2779, "1119": 2780, "1541": 2781, "1456": 2782, "1202": 2783, "1289": 2784, "1705": 2785, "1007": 2786, "1662": 2787, "1218": 2788, "1148": 2789, "681": 2790, "1029": 2791, "1057": 2792, "875": 2793, "1081": 2794, "1570": 2795, "075": 2796, "1295": 2797, "1128": 2798, "1172": 2799, "1031": 2800, "1056": 2801, "1212": 2802, "1059": 2803, "1612": 2804, "1392": 2805, "1020": 2806, "1294": 2807, "1318": 2808, "1024": 2809, "1406": 2810, "1110": 2811, "1762": 2812, "1125": 2813, "1171": 2814, "1290": 2815, "1272": 2816, "1067": 2817, "1103": 2818, "1106": 2819, "1418": 2820, "1283": 2821, "1095": 2822, "1086": 2823, "1041": 2824, "1098": 2825, "1236": 2826, "1137": 2827, "1241": 2828, "1259": 2829, "1210": 2830, "1593": 2831, "1550": 2832, "599": 2833, "1330": 2834, "1328": 2835, "1386": 2836, "1788": 2837, "1022": 2838, "1556": 2839, "1391": 2840, "516": 2841, "1182": 2842, "1342": 2843, "1385": 2844, "1399": 2845, "1417": 2846, "1233": 2847, "1234": 2848, "1576": 2849, "1150": 2850, "1605": 2851, "1728": 2852, "1044": 2853, "1064": 2854, "1586": 2855, "1303": 2856, "1195": 2857, "958": 2858, "1373": 2859, "1907": 2860, "1243": 2861, "1123": 2862, "1198": 2863, "1008": 2864, "1326": 2865, "1144": 2866, "1439": 2867, "1339": 2868, "1005": 2869, "1589": 2870, "1530": 2871, "1401": 2872, "1384": 2873, "1244": 2874, "1464": 2875, "1117": 2876, "1372": 2877, "1329": 2878, "1053": 2879, "1006": 2880, "1181": 2881, "1013": 2882, "1142": 2883, "1420": 2884, "1407": 2885, "1506": 2886, "1099": 2887, "1405": 2888, "1166": 2889, "1138": 2890, "1335": 2891, "1348": 2892, "1017": 2893, "1114": 2894, "1102": 2895, "1116": 2896, "1332": 2897, "1584": 2898, "2226": 2899, "11258": 2900, "2631": 2901, "4122": 2902, "18733": 2903, "337216": 2904, "161451": 2905, "3038": 2906, "565403": 2907, "2196": 2908, "11723": 2909, "3508": 2910, "303327": 2911, "1748": 2912, "340707": 2913, "1881": 2914, "1431": 2915, "5333": 2916, "4606": 2917, "3193": 2918, "10293": 2919, "800690": 2920, "17639": 2921, "548657": 2922, "244593": 2923, "207368": 2924, "9804": 2925, "3427": 2926, "254698": 2927, "3732": 2928, "3181": 2929, "21599": 2930, "4280": 2931, "6029": 2932, "4073": 2933, "13515": 2934, "144982": 2935, "118438": 2936, "1251": 2937, "89769": 2938, "27072": 2939, "10060": 2940, "209585": 2941, "2915": 2942, "1718": 2943, "18293": 2944, "1552": 2945, "3410": 2946, "13874": 2947, "18387": 2948, "819995": 2949, "25570": 2950, "3070": 2951, "353083": 2952, "1915": 2953, "290798": 2954, "8438": 2955, "2694": 2956, "434596": 2957, "241015": 2958, "351710": 2959, "7110": 2960, "181426": 2961, "3902": 2962, "656012": 2963, "3091": 2964, "17766": 2965, "1691": 2966, "1381": 2967, "3821": 2968, "443211": 2969, "274152": 2970, "3513": 2971, "9794": 2972, "175447": 2973, "3340": 2974, "2086": 2975, "609391": 2976, "4319": 2977, "2564": 2978, "547918": 2979, "189783": 2980, "20658": 2981, "260241": 2982, "415886": 2983, "16421": 2984, "16149": 2985, "224542": 2986, "4601": 2987, "582560": 2988, "550400": 2989, "11508": 2990, "273842": 2991, "17821": 2992, "5509": 2993, "224786": 2994, "300771": 2995, "202008": 2996, "4851": 2997, "2245": 2998, "1836": 2999, "3110": 3000, "486956": 3001, "17417": 3002, "18557": 3003, "613862": 3004, "476259": 3005, "215909": 3006, "13437": 3007, "287245": 3008, "2274": 3009, "316888": 3010, "401627": 3011, "4694": 3012, "3791": 3013, "3512": 3014, "807983": 3015, "4212": 3016, "265183": 3017, "12709": 3018, "3200": 3019, "4087": 3020, "305804": 3021, "3773": 3022, "727057": 3023, "5764": 3024, "13544": 3025, "436393": 3026, "10910": 3027, "17075": 3028, "10816": 3029, "4314": 3030, "3838": 3031, "14125": 3032, "3631": 3033, "889736": 3034, "3720": 3035, "10465": 3036, "167226": 3037, "448680": 3038, "19048": 3039, "332838": 3040, "11744": 3041, "4374": 3042, "3653": 3043, "375368": 3044, "431373": 3045, "382052": 3046, "11667": 3047, "2711": 3048, "3330": 3049, "498406": 3050, "243745": 3051, "9357": 3052, "3300": 3053, "428121": 3054, "6397": 3055, "625832": 3056, "370082": 3057, "291213": 3058, "509116": 3059, "8265": 3060, "3051": 3061, "328560": 3062, "4599": 3063, "2863": 3064, "413923": 3065, "23009": 3066, "329163": 3067, "423215": 3068, "16354": 3069, "15423": 3070, "223459": 3071, "12890": 3072, "3600": 3073, "714599": 3074, "2816": 3075, "318788": 3076, "340264": 3077, "466991": 3078, "3422": 3079, "268764": 3080, "403239": 3081, "14613": 3082, "637798": 3083, "615168": 3084, "597521": 3085, "235028": 3086, "406474": 3087, "2665": 3088, "20237": 3089, "1285": 3090, "169805": 3091, "3467": 3092, "201024": 3093, "1355": 3094, "1717": 3095, "510052": 3096, "196026": 3097, "439890": 3098, "17376": 3099, "3397": 3100, "3118": 3101, "18956": 3102, "171211": 3103, "1684": 3104, "344219": 3105, "1766": 3106, "1266": 3107, "3260": 3108, "17280": 3109, "3407": 3110, "3403": 3111, "12817": 3112, "3002": 3113, "4444": 3114, "21742": 3115, "362087": 3116, "10820": 3117, "3263": 3118, "18141": 3119, "3567": 3120, "18472": 3121, "5306": 3122, "3491": 3123, "368673": 3124, "2356": 3125, "3620": 3126, "416312": 3127, "3348": 3128, "4053": 3129, "325934": 3130, "493171": 3131, "2853": 3132, "182802": 3133, "20965": 3134, "3426": 3135, "2633": 3136, "16529": 3137, "5519": 3138, "216271": 3139, "504148": 3140, "1047": 3141, "299397": 3142, "4012": 3143, "9602": 3144, "3162": 3145, "4307": 3146, "10735": 3147, "4927": 3148, "19969": 3149, "3306": 3150, "5247": 3151, "4812": 3152, "11657": 3153, "2699": 3154, "2779": 3155, "9687": 3156, "2726": 3157, "416759": 3158, "21204": 3159, "1499": 3160, "1689": 3161, "122763": 3162, "434967": 3163, "1432": 3164, "15507": 3165, "593605": 3166, "1682": 3167, "13606": 3168, "17463": 3169, "5735": 3170, "2024": 3171, "9389": 3172, "446513": 3173, "438347": 3174, "17128": 3175, "15055": 3176, "621942": 3177, "352639": 3178, "1823": 3179, "290191": 3180, "249208": 3181, "16967": 3182, "2217": 3183, "17791": 3184, "344141": 3185, "3136": 3186, "476953": 3187, "4029": 3188, "3636": 3189, "606003": 3190, "3593": 3191, "14850": 3192, "1650": 3193, "627168": 3194, "5525": 3195, "439389": 3196, "12250": 3197, "4169": 3198, "261225": 3199, "4955": 3200, "2700": 3201, "3495": 3202, "638173": 3203, "276052": 3204, "4317": 3205, "3218": 3206, "11411": 3207, "20369": 3208, "16969": 3209, "173998": 3210, "13550": 3211, "10962": 3212, "11464": 3213, "3651": 3214, "3971": 3215, "15323": 3216, "462498": 3217, "2742": 3218, "1714": 3219, "287394": 3220, "11450": 3221, "140785": 3222, "548659": 3223, "564565": 3224, "798353": 3225, "13865": 3226, "533227": 3227, "13404": 3228, "7380": 3229, "333316": 3230, "7322": 3231, "2836": 3232, "5138": 3233, "380131": 3234, "1895": 3235, "373647": 3236, "4151": 3237, "10008": 3238, "247146": 3239, "4037": 3240, "365509": 3241, "2834": 3242, "1692": 3243, "13280": 3244, "3604": 3245, "212523": 3246, "5448": 3247, "293032": 3248, "6171": 3249, "2336": 3250, "2120": 3251, "270197": 3252, "16687": 3253, "13159": 3254, "18580": 3255, "336604": 3256, "6935": 3257, "2526": 3258, "17771": 3259, "3839": 3260, "3969": 3261, "369138": 3262, "549642": 3263, "400781": 3264, "3050": 3265, "2205": 3266, "477784": 3267, "3881": 3268, "352389": 3269, "1656": 3270, "8410": 3271, "16174": 3272, "12491": 3273, "15895": 3274, "351405": 3275, "14498": 3276, "528561": 3277, "3446": 3278, "577922": 3279, "175468": 3280, "2963": 3281, "3966": 3282, "13501": 3283, "2639": 3284, "17049": 3285, "2706": 3286, "1344": 3287, "10261": 3288, "4047": 3289, "685010": 3290, "324790": 3291, "217726": 3292, "245621": 3293, "362646": 3294, "372705": 3295, "451041": 3296, "3746": 3297, "2956": 3298, "2916": 3299, "157257": 3300, "32421": 3301, "349153": 3302, "3447": 3303, "550900": 3304, "3418": 3305, "517452": 3306, "10328": 3307, "9423": 3308, "629992": 3309, "23699": 3310, "12382": 3311, "4418": 3312, "20879": 3313, "7967": 3314, "16337": 3315, "14812": 3316, "449229": 3317, "15558": 3318, "671939": 3319, "12682": 3320, "1536": 3321, "175183": 3322, "15889": 3323, "3511": 3324, "645209": 3325, "13206": 3326, "2603": 3327, "562311": 3328, "412293": 3329, "1831": 3330, "3360": 3331, "5018": 3332, "11558": 3333, "437526": 3334, "221537": 3335, "1547": 3336, "1091": 3337, "4598": 3338, "268197": 3339, "1737": 3340, "289305": 3341, "10046": 3342, "218319": 3343, "3159": 3344, "3255": 3345, "288796": 3346, "427426": 3347, "1379": 3348, "1325": 3349, "2860": 3350, "255523": 3351, "1668": 3352, "804755": 3353, "374359": 3354, "20345": 3355, "3429": 3356, "747920": 3357, "4619": 3358, "3206": 3359, "4738": 3360, "20069": 3361, "3016": 3362, "13218": 3363, "5669": 3364, "490442": 3365, "1445": 3366, "17232": 3367, "4110": 3368, "3644": 3369, "3869": 3370, "3258": 3371, "409010": 3372, "2861": 3373, "13392": 3374, "2898": 3375, "787550": 3376, "4344": 3377, "214416": 3378, "3158": 3379, "267131": 3380, "209751": 3381, "12572": 3382, "257108": 3383, "337617": 3384, "15100": 3385, "12005": 3386, "2684": 3387, "382518": 3388, "9468": 3389, "252846": 3390, "341390": 3391, "3515": 3392, "349736": 3393, "3652": 3394, "317312": 3395, "582686": 3396, "4914": 3397, "3214": 3398, "742274": 3399, "10510": 3400, "12328": 3401, "4710": 3402, "2155": 3403, "17819": 3404, "14380": 3405, "8891": 3406, "183497": 3407, "268026": 3408, "368151": 3409, "213283": 3410, "299189": 3411, "13868": 3412, "3150": 3413, "521180": 3414, "314567": 3415, "369066": 3416, "342203": 3417, "3033": 3418, "824004": 3419, "443974": 3420, "526140": 3421, "19008": 3422, "17696": 3423, "295068": 3424, "6901": 3425, "3540": 3426, "1422": 3427, "3571": 3428, "337416": 3429, "17144": 3430, "17045": 3431, "522874": 3432, "838902": 3433, "23417": 3434, "2962": 3435, "771570": 3436, "354469": 3437, "2494": 3438, "288272": 3439, "2964": 3440, "4125": 3441, "14321": 3442, "9348": 3443, "3876": 3444, "3113": 3445, "15334": 3446, "3409": 3447, "12574": 3448, "331062": 3449, "13959": 3450, "466475": 3451, "3134": 3452, "655906": 3453, "319366": 3454, "19084": 3455, "3580": 3456, "4395": 3457, "4939": 3458, "18699": 3459, "3476": 3460, "264484": 3461, "530662": 3462, "16557": 3463, "15490": 3464, "12823": 3465, "3530": 3466, "16694": 3467, "2941": 3468, "4240": 3469, "4670": 3470, "276484": 3471, "3356": 3472, "3576": 3473, "9633": 3474, "17360": 3475, "177292": 3476, "9101": 3477, "11832": 3478, "5715": 3479, "13297": 3480, "235690": 3481, "333992": 3482, "7740": 3483, "539108": 3484, "416259": 3485, "1642": 3486, "623945": 3487, "3270": 3488, "3357": 3489, "8843": 3490, "1846": 3491, "322803": 3492, "4959": 3493, "5766": 3494, "8176": 3495, "5738": 3496, "526385": 3497, "11184": 3498, "176947": 3499, "419620": 3500, "205554": 3501, "10909": 3502, "3997": 3503, "209972": 3504, "3052": 3505, "357148": 3506, "525288": 3507, "17866": 3508, "443963": 3509, "122972": 3510, "19917": 3511, "10665": 3512, "168113": 3513, "14104": 3514, "139203": 3515, "16116": 3516, "4586": 3517, "2492": 3518, "9663": 3519, "354680": 3520, "215123": 3521, "16352": 3522, "14851": 3523, "341813": 3524, "11568": 3525, "381343": 3526, "650021": 3527, "1574": 3528, "394570": 3529, "2584": 3530, "4833": 3531, "16375": 3532, "2172": 3533, "22251": 3534, "2883": 3535, "3302": 3536, "16862": 3537, "1614": 3538, "3663": 3539, "16667": 3540, "307769": 3541, "304510": 3542, "374656": 3543, "5931": 3544, "284257": 3545, "203945": 3546, "616880": 3547, "413093": 3548, "18893": 3549, "2976": 3550, "13350": 3551, "12038": 3552, "2406": 3553, "650621": 3554, "442383": 3555, "3626": 3556, "14684": 3557, "20327": 3558, "626442": 3559, "3527": 3560, "9471": 3561, "513188": 3562, "16698": 3563, "2234": 3564, "15422": 3565, "3338": 3566, "18032": 3567, "238108": 3568, "690678": 3569, "466027": 3570, "515964": 3571, "3003": 3572, "198458": 3573, "564444": 3574, "413662": 3575, "3105": 3576, "2705": 3577, "549178": 3578, "577318": 3579, "483260": 3580, "3797": 3581, "177326": 3582, "769159": 3583, "2725": 3584, "134742": 3585, "573100": 3586, "445506": 3587, "181506": 3588, "454788": 3589, "11687": 3590, "248505": 3591, "157661": 3592, "14535": 3593, "566943": 3594, "644420": 3595, "3694": 3596, "17371": 3597, "3190": 3598, "14219": 3599, "357980": 3600, "375364": 3601, "4775": 3602, "17841": 3603, "634066": 3604, "10555": 3605, "15243": 3606, "2909": 3607, "596349": 3608, "504059": 3609, "14654": 3610, "9181": 3611, "9632": 3612, "8301": 3613, "1107": 3614, "3175": 3615, "2685": 3616, "522384": 3617, "173937": 3618, "343773": 3619, "2651": 3620, "327347": 3621, "3783": 3622, "11438": 3623, "4057": 3624, "5582": 3625, "403788": 3626, "14984": 3627, "194841": 3628, "13599": 3629, "2627": 3630, "507344": 3631, "18155": 3632, "3004": 3633, "385656": 3634, "1740": 3635, "2840": 3636, "600436": 3637, "451802": 3638, "200297": 3639, "5364": 3640, "613888": 3641, "535092": 3642, "3171": 3643, "4165": 3644, "1378": 3645, "428514": 3646, "220865": 3647, "2559": 3648, "14538": 3649, "5284": 3650, "478815": 3651, "308127": 3652, "20619": 3653, "2525": 3654, "646226": 3655, "265432": 3656, "347858": 3657, "17229": 3658, "1723": 3659, "535886": 3660, "1002517": 3661, "532701": 3662, "2919": 3663, "273305": 3664, "231977": 3665, "2333": 3666, 